In [2]:
import pandas as pd

In [3]:
data_file = pd.read_csv("./2.1 salaries_by_college_major.csv")
data_file.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

#### shows if there are NaN values in the dataframe
data_file.isna()

In [4]:
# we create a clean data_file by using the method .dropna()
clean_data_file = data_file.dropna()
clean_data_file.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [5]:
clean_data_file["Starting Median Salary"].max()

74300.0

In [6]:
# .idmax() returns the index to the row containing the max value

max_pointer = clean_data_file["Starting Median Salary"].idxmax()
clean_data_file["Undergraduate Major"].loc[max_pointer]

'Physician Assistant'

In [7]:
# .loc[] returns the row pointed by the index
clean_data_file.loc[(max_pointer)]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

In [8]:
spread_col = clean_data_file["Mid-Career 90th Percentile Salary"].subtract(clean_data_file["Mid-Career 10th Percentile Salary"])

# .insert(column position, Name of the column, colum dataframe)
clean_data_file.insert(1, "Spread", spread_col)
clean_data_file.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [9]:
lowest_spread= clean_data_file["Spread"].idxmin()
clean_data_file[["Undergraduate Major", "Spread"]].loc[lowest_spread]

Undergraduate Major    Nursing
Spread                 50700.0
Name: 40, dtype: object

In [10]:
low_risk = clean_data_file.sort_values("Spread")
low_risk[["Undergraduate Major", "Spread"]].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

# Manipulate data by Pivoting with the .groupby() method

In [12]:
clean_data_file.groupby("Group").count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [14]:
round(clean_data_file.groupby("Group").mean(), 2)

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,103958.33,44633.33,75083.33,43566.67,147525.00
HASS,95218.18,37186.36,62968.18,34145.45,129363.64
STEM,101600.00,53862.50,90812.50,56025.00,157625.00

In [16]:
# or we can use to round up the numbers:
pd.options.display.float_format = "{:,.2f}".format
clean_data_file.groupby("Group").mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"